<div class="bg-white pt-4">
    <section>
        <div class="prs-responsive">
            <div class="container-fluid">
                <div class="row">
                    <div class="col-md-12 parent-host m-auto-x d-flex justify-content-center">
                        <div class="right-host">
                            @guest
                                <div class="login-box w-100">
                                    <ul>
                                        @foreach ($errors->all() as $error)
                                            <li>
                                                {{ $error }}
                                            </li>
                                        @endforeach
                                    </ul>
                                    <form class="w-100 login-form d-flex flex-column align-items-center"
                                        wire:submit.prevent="submit">
                                        <div class="item w-75 d-flex flex-column align-items-center">
                                            <h2 class="title-host">میزبان شوید</h2>
                                            <div class="label w-100 d-flex justify-content-start">
                                                <svg xmlns="http://www.w3.org/2000/svg" width="21.162" height="16.698"
                                                    viewBox="0 0 21.162 16.698">
                                                    <path id="_001-mail_inbox_app" data-name="001-mail inbox app"
                                                        d="M16.2,70.7H4.96A4.965,4.965,0,0,1,0,65.738V58.96A4.965,4.965,0,0,1,4.96,54H16.2a4.965,4.965,0,0,1,4.96,4.96v6.778A4.965,4.965,0,0,1,16.2,70.7ZM4.96,55.653A3.31,3.31,0,0,0,1.653,58.96v6.778A3.31,3.31,0,0,0,4.96,69.045H16.2a3.31,3.31,0,0,0,3.307-3.307V58.96A3.31,3.31,0,0,0,16.2,55.653Zm8.65,8.159L17.7,60.691a.827.827,0,0,0-1-1.314L12.607,62.5a3.315,3.315,0,0,1-4.008,0L4.641,59.423a.827.827,0,0,0-1.015,1.305l3.962,3.08.006,0a4.972,4.972,0,0,0,6.016,0Z"
                                                        transform="translate(0 -54)" fill="#c49c74"></path>
                                                </svg>
                                                <label for="">شماره همراه</label>
                                            </div>
                                            <input class="inp-fix" type="text" wire:model.defer="user.username">
                                        </div>
                                        @isset($user['password'])
                                            <div class="item">
                                                <div class="label">
                                                    <svg xmlns="http://www.w3.org/2000/svg" id="Outline" viewBox="0 0 24 24"
                                                        width="22" height="22">
                                                        <path fill="#C49C74"
                                                            d="M19,8.424V7A7,7,0,0,0,5,7V8.424A5,5,0,0,0,2,13v6a5.006,5.006,0,0,0,5,5H17a5.006,5.006,0,0,0,5-5V13A5,5,0,0,0,19,8.424ZM7,7A5,5,0,0,1,17,7V8H7ZM20,19a3,3,0,0,1-3,3H7a3,3,0,0,1-3-3V13a3,3,0,0,1,3-3H17a3,3,0,0,1,3,3Z" />
                                                        <path fill="#C49C74"
                                                            d="M12,14a1,1,0,0,0-1,1v2a1,1,0,0,0,2,0V15A1,1,0,0,0,12,14Z" />
                                                    </svg>
                                                    <label for="">رمز عبور</label>
                                                </div>
                                                <input class="inp-fix" type="text" wire:model.defer="user.password">
                                            </div>
                                        @endisset
                                        @isset($user['token'])
                                            <div class="item">
                                                <div class="label">
                                                    <svg xmlns="http://www.w3.org/2000/svg" id="Outline" viewBox="0 0 24 24"
                                                        width="22" height="22">
                                                        <path fill="#C49C74"
                                                            d="M19,8.424V7A7,7,0,0,0,5,7V8.424A5,5,0,0,0,2,13v6a5.006,5.006,0,0,0,5,5H17a5.006,5.006,0,0,0,5-5V13A5,5,0,0,0,19,8.424ZM7,7A5,5,0,0,1,17,7V8H7ZM20,19a3,3,0,0,1-3,3H7a3,3,0,0,1-3-3V13a3,3,0,0,1,3-3H17a3,3,0,0,1,3,3Z" />
                                                        <path fill="#C49C74"
                                                            d="M12,14a1,1,0,0,0-1,1v2a1,1,0,0,0,2,0V15A1,1,0,0,0,12,14Z" />
                                                    </svg>
                                                    <label for="">کد تایید</label>
                                                </div>
                                                <input type="text" wire:model.defer="user.token">
                                            </div>
                                        @endisset
                                        <div class="submit d-flex flex-column align-items-center w-50">
                                            <button class="btn-login" href="">
                                                <i class="icon-circle"></i>
                                                بررسی حساب کاربری
                                            </button>
                                            @if ($step != 'validation')
                                                <a class="under-link" type="button" wire:click="sendMessage()">
                                                    @switch($step)
                                                        @case('login')
                                                            رمز یکبار مصرف
                                                        @break

                                                        @case('register')
                                                            ارسال دوباره کد تایید
                                                        @break
                                                    @endswitch
                                                </a>
                                            @endif
                                            <p class="text-center mt-3 f-13">
                                                برای میزبانی در ویلا شما شرایط و قوانین استفاده از
                                                سرویس های سایت ویلا و قوانین حریم خصوصی آن را می‌پذیرید.
                                            </p>
                                        </div>
                                    </form>
                                </div>
                            @endguest
                            @auth
                          <div class="privacy-content-parent">
                            <span class="privacy-content">
                                این تفاهم نامه همکاری فی ما بین شرکت --- ( سهامی خاص)، به نشانی تهران،
                                خیابان --- کوچه --- پلاک --- که از این پس به اختصار "اقامت باما" نامیده می‌شود(صاحب امتیاز
                                وبسایت www.eghamatbama.com ) و مالک یا دارنده کلید اقامتگاه که از این پس "میزبان" نامیده می شود،
                                منعقد می‌گردد.
                                تبصره ۱: فردی که نسبت به رزرو روزانه و یا میان مدت اقامتگاه بصورت آنلاین از طریق وبسایت
                                اقامت باما اقدام میکند مهمان نامیده می‌شود.
                                ماده ۱: موضوع تفاهم نامهموضوع این تفاهم نامه عبارت است از ارائه خدمات رزرو آنلاین روزانه
                                یا میان مدت و تبلیغات اینترنتی اقامتگاه از طرف اقامت باما برای میزبان، از طریق دریافت مبلغ رزرو
                                به صورت آنلاین.
                                ماده۲: مبلغ تفاهم نامه۲-۱) نحوه ی پرداخت حق الزحمه اقامت باما، بابت بازاریابی ، مطابق اعداد مورد
                                توافق ۱۰٪ از مبلغ پرداختی مهمان به وبسایت خواهد بود.۲-۲) میزبان مبلغ رزرو خود را پس از
                                کسر کارمزد اقامت باما دریافت می‌کند.۲-۳) زمان پرداخت مبلغ رزرو به میزبان یک روز کاری پس از
                                پرداخت مهمان خواهد بود.۲-۴) تمام پرداخت‌های فی مابین لازم است به شماره حساب بانکی اعلام
                                شده توسط میزبان انجام شود. هرگونه تغییری برای شماره حساب از جانب میزبان، باید بصورت کتبی
                                و یا ایمیل به اقامت باما اعلام گردد.
                                ماده۳: تعهدات اقامت باما۳-۱) اقامت باما میزبان را در زمینه فروش و بازاریابی آنلاین برای رزرو پشتیبانی
                                کرده و در همین راستا اقدامات لازم را مبذول خواهد داشت.۳-۲) پشتیبانی تلفنی مهمان بر عهده
                                اقامت باما است.۳-۳) اقامت باما متعهد به پرداخت به موقع به میزبانها (طبق ماده2-2)خواهد بود.
                                ماده ۴:تعهدات میزبان۴-۱) میزبان متعهد میشود کلیه اطلاعات، شرایط عمومی و عکس اقامتگاه را
                                جهت درج به اقامت باما تحویل دهد و یا در وبسایت اقامت باما وارد نماید.۴-۲) میزبان متعهد می‌شود نسبت به
                                بروزرسانی آنلاین تقویم و نرخ‌های هر اقامتگاه راسا و به موقع اقدام نماید.۴-۳) نظافت اولیه
                                (جارو، نظافت یخچال ، سینک آشپزخانه تمیز، سرویس های بهداشتی ، تعویض ملحفه ، تخلیه سطل
                                آشغال ها، آب استخر تمیز و ... ) بعد از خروج هر مهمان به عهده میزبان است.۴-۴) میزبان
                                نمی‌تواند پس از دریافت وجه از سایت اقامت باما، نسبت به کنسل کردن رزرو اقدام نماید.۴-۵) میزبان
                                متعهد می‌شود پس از تائید درخواست مهمان حداکثر تا ۲ ساعت اقامتگاه را برای مهمان خالی نگه
                                دارد. در صورتی که مهمان دیگری بصورت حضوری در این بازه زمانی جهت رزرو و پرداخت اقدام نمود
                                میزبان متعهد است تا مراتب را به سایت اطلاع دهد.۴-۶) میزبان نسبت به انطباق اطلاعات و
                                شرایط فیزیکی واقعی اقامتگاه و تطابق آن با عکسها مسئول است. در صورت مغایرت، اقامت باما مجاز خواهد
                                بود ضمن بازگرداندن وجه دریافتی از مهمان و کسر آن از حساب میزبان، ۲۰٪ از مبلغ پرداختی را
                                بعنوان ضرر و زیان خود در حساب بستانکاری از میزبان لحاظ نماید.۴-۷) در صورت فعال کردن
                                گزینه رزرو آنی برای هر اقامتگاه، مهمان امکان استفاده از تخفیف‌های اقامت باماانه (رزرو سریع) را
                                دارد. در این صورت به‌روزرسانی لحظه‌ای تقویم اجباری است.تبصره ۱-۴: تخفیف های لحظه آخری از
                                ساعت ۲ ظهر تا ۱۲ اقامت باما فعال بوده و پرداخت آن توسط مهمان بدون معطلی و بدون نیاز به تایید
                                میزبان صورت می‌گیرد. این گزینه در صورت عدم رزرو اقامتگاه بصورت خودکار فعال می‌گردد.۴-۸)
                                میزبانی که گزینه رزرو آنی را فعال نکند متعهد میشود در کمتر از ۲ ساعت به درخواست رزرو
                                پاسخ دهد.( قبول یا رد کند)۴-۹) میزبان متعهد به بستن قرارداد فیزیکی با مهمان است. کارت
                                شناسایی مهمان بعنوان تضمین و امانت در طول در اختیار میزبان خواهد بود. در صورت لزوم اقامت باما
                                می‌تواند نسبت به درخواست قرارداد از میزبان اقدام نماید.تبصره ۲-۴: در رزروهای میان مدت
                                تضمین قرارداد بین میزبان و مهمان توافقی خواهد بود.۴-۱۰) میزبان متعهد می‌شود در راستای
                                تبلیغات و ارائه خدمات بهتر نسبت به همکاری‌های لازم با اقامت باما و مهمانان آن اقدام نماید.
                                ماده ۵: شرایط عمومی۵-۱) مهمان موظف به بازگرداندن اقامتگاه با همان شرایط اولیه پس از
                                پایان دوره اقامت به میزبان است. در صورت بروز مشکل، حل و فصل آن برعهده‌ی میزبان و مهمان
                                بوده و اقامت باما مسئولیتی در این خصوص ندارد. اما اقامت باما می‌تواند نسبت به حذف حساب کاربری فرد متخلف
                                از وبسایت خود اقدام نماید. تا زمان تایید پرداخت مهمان و اطلاع آن توسط اقامت باما، اقامتگاه خالی
                                محسوب شده و هر درخواست رزروی قابل تایید است.۵-۲) در صورت کنسل کردن رزرو توسط مهمان، وجه
                                بر اساس ماده 6 بازپرداخت خواهد شد.
                                ماده۶ : شرایط کنسلی توسط مهمانسهل‌گیرانه
                                تا قبل از روز شروع اقامت مهمان: مبلغی بابت خسارت از او نمی‌خواهم.در حین اقامت: کسر مبلغ
                                اقامت باما های اقامت داشته را به عنوان خسارت دریافت می‌کنمدر ایام پیک (تعطیلات رسمی به غیر از
                                تعطیلات نوروز): تا قبل از ۳ روز به شروع اقامت مبلغی بابت خسارت از او نمی‌خواهم و کمتر از
                                ۳ روز به شروع اقامت کل مبلغ رزرو را به عنوان خسارت می‌خواهمرزروهای بلند مدت (۱۴ روز به
                                بالا) مبلغ ۳ روز اول رزرو را به عنوان خسارت می‌خواهم.در صورت کنسلی رزرو از سوی شما
                                میزبان محترم:- کسر 10 %از مبلغ کل رزرو به عنوان خسارت که از رزرو بعدی شما کسر خواهد شد.-
                                بعد از هر 10 رزرو موفق پی در پی این اقامتگاه از سوی شما، 1 مرتبه امکان کنسلی بدون دریافت
                                خسارت برای شما امکان پذیر می‌باشد.
                                متعادل
                                تا ۷۲ ساعت مانده به روز شروع اقامت مهمان: مبلغی بابت خسارت از او نمی‌خواهم.کمتر از ۷۲
                                ساعت مانده تا روز شروع اقامت مهمان: مبلغ اولین اقامت باما رزرو را به عنوان خسارت دریافت
                                می‌کنم.روز شروع اقامت مهمان:مبلغ 2 اقامت باما اول رزرو به عنوان خسارت دریافت می‌کنم.در حین
                                اقامت: کسر مبلغ اقامت باما‌های اقامت داشته + اقامت باما بعدی را به عنوان خسارت دریافت می‌کنم.در ایام پیک
                                (تعطیلات رسمی به غیر از تعطیلات نوروز): تا قبل از ۷ روز به شروع اقامت مبلغی بابت خسارت
                                از او نمی‌خواهم و کمتر از ۷ روز به شروع اقامت کل مبلغ رزرو را با عنوان خسارت
                                می‌خواهم.رزروهای بلند مدت (۱۴ روز به بالا) مبلغ ۵ روز اول رزرو را به عنوان خسارت
                                می‌خواهم.در صورت کنسلی رزرو از سوی شما میزبان محترم:- کسر 10 %از مبلغ کل رزرو به عنوان
                                خسارت که از رزرو بعدی شما کسر خواهد شد.- بعد از هر 15 رزرو موفق پی در پی این اقامتگاه از
                                سوی شما، 1 مرتبه امکان کنسلی بدون دریافت خسارت برای شما امکان پذیر می‌باشد
                                سخت‌گیرانه
                                کل مبلغ پرداختی مهمان را به عنوان خسارت می‌خواهم و امکان کنسلی وجود ندارد.رزروهای بلند
                                مدت (۱۴ روز به بالا) مبلغ ۷ روز اول رزرو را به عنوان خسارت می‌خواهم.در صورت کنسلی رزرو
                                از سوی شما میزبان محترم:- کسر 15 %از مبلغ کل رزرو به عنوان خسارت که از رزرو بعدی شما کسر
                                خواهد شد.- بعد از هر 20 رزرو موفق پی در پی این اقامتگاه از سوی شما، 1 مرتبه امکان کنسلی
                                بدون دریافت خسارت برای شما امکان پذیر می‌باشد.


                                ماده ۷: شرایط فورس ماژوراصل بر الزام آوری این تفاهم نامه است و موضوع فورس ماژور طبق ماده
                                ۲۲۹ قانون مدنی ایران، ناظر بر وجود همزمان سه شرط غیر قابل اجتناب وغیر قابل پیش بینی بودن
                                رخداد و وقوع عامل مستحدث خارجی منصرف از اراده طرفین است.
                                ماده ۸: فسخ۸-۱) چنانچه میزبان به هر کدام از تعهدات خود در این تفاهم نامه عمل نکند اقامت باما
                                می‌تواند نسبت به فسخ بصورت یکطرفه اقدام نماید.۸-۲) شرایط فورس ماژور به خودی خود سبب فسخ
                                این تفاهم نامه است.

                            </span>

                            <button class="privacy-content-button" wire:click="changeUserRole()">قوانین را خوانده و میپذیرم</button>
                          </div>
                            @endauth
                              


                        </div>
                        <div class="left-host">

                        </div>
                    </div>
                </div>
            </div>
        </div>
    </section>













    {{-- <section class="s-about-us-bottom-1"> --}}
    {{-- <div class="container"> --}}
    {{-- <div class="row g-2"> --}}
    {{-- <div class="col-md-11"> --}}
    {{-- <div class="card"> --}}
    {{-- <div class="card-header"> --}}
    {{-- <h6>ورود|ثبت نام</h6> --}}
    {{-- </div> --}}
    {{-- <div class="card-body"> --}}
    {{-- <ul> --}}
    {{-- @foreach ($errors->all() as $error) --}}
    {{-- <li> --}}
    {{-- {{ $error }} --}}
    {{-- </li> --}}
    {{-- @endforeach --}}
    {{-- </ul> --}}
    {{-- <form wire:submit.prevent="submit"> --}}
    {{-- <div class="form-floating mb-3"> --}}
    {{-- <input type="text" class="form-control" id="username" --}}
    {{-- wire:model.defer="user.username"> --}}
    {{-- <label for="username">ایمیل یا شماره همراه</label> --}}
    {{-- </div> --}}
    {{-- @isset($user['password']) --}}
    {{-- <div class="form-floating mb-3"> --}}
    {{-- <input type="password" class="form-control" id="password" --}}
    {{-- wire:model.defer="user.password"> --}}
    {{-- <label for="password">رمز عبور</label> --}}
    {{-- </div> --}}
    {{-- @endisset --}}
    {{-- @isset($user['token']) --}}
    {{-- <div class="form-floating mb-3"> --}}
    {{-- <input type="text" class="form-control" id="token" --}}
    {{-- wire:model.defer="user.token"> --}}
    {{-- <label for="token">کد تایید</label> --}}
    {{-- </div> --}}
    {{-- @endisset --}}
    {{-- <div class="mb-3"> --}}
    {{-- <button class="btn btn-primary">بررسی</button> --}}
    {{-- @if ($step != 'validation') --}}
    {{-- <button type="button" wire:click="sendMessage()" class="btn btn-link"> --}}
    {{-- @switch($step) --}}
    {{-- @case('login') --}}
    {{-- رمز یک بار مصرف --}}
    {{-- @break --}}
    {{-- @case('register') --}}
    {{-- ارسال دوباره کد تایید --}}
    {{-- @break --}}
    {{-- @endswitch --}}
    {{-- </button> --}}
    {{-- @endif --}}
    {{-- </div> --}}
    {{-- </form> --}}
    {{-- </div> --}}
    {{-- </div> --}}
    {{-- </div> --}}
    {{-- </div> --}}
    {{-- </div> --}}
    {{-- </section> --}}
</div>
